public class User{
    public string nameUniversity;

    public User(string nameUniversity){
        this.nameUniversity = nameUniversity;
    }  

    public void printUniversity(){  
         double sum1,sum2,sum3,sum4,sum5;
            sum1 = 10.2 + 7.3 + 8.4 + 5.6 + 9.3 + 4.6 + 1.2 + 7.5 + 8.2 + 4.3 + 6.0 + 7.0;
            sum2 = 9.2 + 5.2 + 8.9 + 7.1 + 9.3 + 2.2 + 1.7 + 5.2 + 9.1 + 8.4 + 2.1 + 2.3;
            sum3 = 17.2 + 19  +  23 + 25.1 + 31  + 32.1 + 17.0 +  14 + 11.3 + 18.1 + 19.2 + 22;
            sum4 = 2.1+2.0+1.1+1.5+3.2+4.1+2.2+2.2+1.3+1.4+5.0+4.1;
            sum5 = 17.2+20+23+25.1+31+4.1+17.0+14+11.3+5.0+19.2+22;
        string u1,u2,u3,u4,u5;
        u1 = "จุฬาลงกรณ์มหาวิทยาลัย";
        u2 = "มหาวิทยาลัยมหิดล";
        u3 = "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง";
        u4 = "มหาวิทยาลัยขอนแก่น";
        u5 = "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี";

        switch (nameUniversity){
            case "1": 
            Console.WriteLine("มหาวิยาลัย : จุฬาลงกรณ์มหาวิทยาลัย                        | ชื่อห้องสมุด : รักดี   | ที่อยู่ : เขตปทุมวัน กทม.    | เบอร์โทร : 02-215-3555",u1);
            Console.WriteLine("มหาวิยาลัย : มหาวิทยาลัยมหิดล                            | ชื่อห้องสมุด : รักโลก | ที่อยู่ : เขตศาลายา นครปฐม | เบอร์โทร : 02-849-6211",u2);
            Console.WriteLine("มหาวิยาลัย : สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง | ชื่อห้องสมุด : เกย์กีย์ | ที่อยู่ : เขตลาดกระบัง กทม. | เบอร์โทร : 02-329-8000",u3);
            Console.WriteLine("มหาวิยาลัย : มหาวิทยาลัยขอนแก่น                          | ชื่อห้องสมุด : วัฒนะ  | ที่อยู่ : เขตในเมือง ขอนแก่น | เบอร์โทร : 043-002-5399",u4);
            Console.WriteLine("มหาวิยาลัย : มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี          | ชื่อห้องสมุด : อาธร  | ที่อยู่ : เขตทุ่งครุ กทม.     | เบอร์โทร : 02-470-8000",u5);
            break;



            case "2":
            Console.WriteLine("มหาวิยาลัย : จุฬาลงกรณ์มหาวิทยาลัย                        | ชื่อ : นายชัยดี  | นามสกุล : รักดี   | รหัสบัตรประชาชน : 153-698-4561237");
            Console.WriteLine("มหาวิยาลัย : มหาวิทยาลัยมหิดล                            | ชื่อ : นายนอนดี | นามสกุล : ใจดี   | รหัสบัตรประชาชน : 742-112-5687412");
            Console.WriteLine("มหาวิยาลัย : สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง | ชื่อ : นายอภัยดี | นามสกุล : เรียนดี | รหัสบัตรประชาชน : 541-772-3215689");
            Console.WriteLine("มหาวิยาลัย : มหาวิทยาลัยขอนแก่น                          | ชื่อ : นายทำดี  | นามสกุล : งานดี  | รหัสบัตรประชาชน : 777-772-4578923");
            Console.WriteLine("มหาวิยาลัย : มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี          | ชื่อ : นายนอนดี | นามสกุล : เรียนดี | รหัสบัตรประชาชน : 003-852-4752000");
            break;



            case "3":
            Console.WriteLine("จุฬาลงกรณ์มหาวิทยาลัย                        | ค่า FT : {0}" ,sum1);
            Console.WriteLine("มหาวิทยาลัยมหิดล                            | ค่า FT : {0}" ,sum2);
            Console.WriteLine("สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง | ค่า FT : {0}" ,sum3);
            Console.WriteLine("มหาวิทยาลัยขอนแก่น                          | ค่า FT : {0}" ,sum4);
            Console.WriteLine("มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี          | ค่า FT : {0}" ,sum5);
            break;

            case "4":
            double min1, min2, min3, min4, min5, min6;
            min1 = Math.Min(sum1,sum2); min2 = Math.Min(sum3,sum4); min3 = Math.Min(sum5,sum1);
            min4 = Math.Min(min1,min2); min5 = Math.Min(min3,min1);
            min6 = Math.Min(min4,min5);
            Console.WriteLine("*******************************************");
            Console.WriteLine("");
            Console.WriteLine("         มหาวิทยาลัยที่ใช้ไฟน้อยที่สุด");
            if (min6 == sum1){ Console.WriteLine("{0} ใช้ไป {1}",u1 ,min6); } 
            else if (min6 == sum2) {Console.WriteLine("{0} ใช้ไป {1}",u2 ,min6);}
            else if (min6 == sum3) {Console.WriteLine("{0} ใช้ไป {1}",u3 ,min6);}
            else if (min6 == sum4) {Console.WriteLine("{0} ใช้ไป {1}",u4 ,min6);}
            else if (min6 == sum5) {Console.WriteLine("{0} ใช้ไป {1}",u5 ,min6);}
            Console.WriteLine("");
            Console.WriteLine("*******************************************");
            break;

         }
        
    }

}